<a href="https://colab.research.google.com/github/7ryean/PYTHON/blob/main/BOAZ_PYTHON_STUDY.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## BOAZ 16기 시각화 멘토링 D조 1차시 과제

첫 멘토링 너무 고생 많으셨습니다! 오늘 풀이한 내용을 기반으로 간단한 과제가 있습니다. 제출 기한은 없지만 다음 차시 이전까지 풀어보고 질문사항은 멘토링 시간에 해주시면 됩니다.

### 문제 1-1

19단 곱셈표 완성하기. for문을 활용하여 2X2부터 9X9까지 만들어주세요.

In [ ]:
for i in range (1,9) :
  i = i + 1
  for j in range(1,10) :
    print(str(i), 'X', str(j), '=', str(i*j))

2 X 1 = 2
2 X 2 = 4
2 X 3 = 6
2 X 4 = 8
2 X 5 = 10
2 X 6 = 12
2 X 7 = 14
2 X 8 = 16
2 X 9 = 18
3 X 1 = 3
3 X 2 = 6
3 X 3 = 9
3 X 4 = 12
3 X 5 = 15
3 X 6 = 18
3 X 7 = 21
3 X 8 = 24
3 X 9 = 27
4 X 1 = 4
4 X 2 = 8
4 X 3 = 12
4 X 4 = 16
4 X 5 = 20
4 X 6 = 24
4 X 7 = 28
4 X 8 = 32
4 X 9 = 36
5 X 1 = 5
5 X 2 = 10
5 X 3 = 15
5 X 4 = 20
5 X 5 = 25
5 X 6 = 30
5 X 7 = 35
5 X 8 = 40
5 X 9 = 45
6 X 1 = 6
6 X 2 = 12
6 X 3 = 18
6 X 4 = 24
6 X 5 = 30
6 X 6 = 36
6 X 7 = 42
6 X 8 = 48
6 X 9 = 54
7 X 1 = 7
7 X 2 = 14
7 X 3 = 21
7 X 4 = 28
7 X 5 = 35
7 X 6 = 42
7 X 7 = 49
7 X 8 = 56
7 X 9 = 63
8 X 1 = 8
8 X 2 = 16
8 X 3 = 24
8 X 4 = 32
8 X 5 = 40
8 X 6 = 48
8 X 7 = 56
8 X 8 = 64
8 X 9 = 72
9 X 1 = 9
9 X 2 = 18
9 X 3 = 27
9 X 4 = 36
9 X 5 = 45
9 X 6 = 54
9 X 7 = 63
9 X 8 = 72
9 X 9 = 81

### 문제 1-2
0부터 10까지의 팩토리얼 계산을 해주세요.

In [ ]:
fac = 1
for i in range (1, 11) :
  fac = fac * i
  print(i,'! =', fac)

1 ! = 1
2 ! = 2
3 ! = 6
4 ! = 24
5 ! = 120
6 ! = 720
7 ! = 5040
8 ! = 40320
9 ! = 362880
10 ! = 3628800

In [ ]:
# 해설

fac = 1
for i in range (0, 11) :
  if i == 0:
    print()
  else :
   fac = fac * i
  print(i,'! =', fac)

0 ! = 1
1 ! = 1
2 ! = 2
3 ! = 6
4 ! = 24
5 ! = 120
6 ! = 720
7 ! = 5040
8 ! = 40320
9 ! = 362880
10 ! = 3628800

### 문제 2

def문으로 사칙 연산을 모두 수행하는 함수 calculator()를 만들어주세요.

calculator() 함수는 인자로 두 수를 받아 더하기, 빼기, 곱하기, 나누기를 각각 수행합니다.

In [ ]:
def calculator

In [ ]:
def calculator (a, b) :
  print((a+b), (a-b), (a*b), (a/b))

calculator (10,5)

15 5 50 2.0

In [ ]:
calculator(10,5)

(15, 5, 50, 2.0)

### 문제 3

랜덤하게 생성된 리스트를 내림차순 정렬해주세요.

In [ ]:
import random
nums = []
for i in range(10):
  nums.append(random.randint(1,100))

print('randomly pushed list : ', nums)

randomly pushed list :  [89, 2, 30, 12, 12, 1, 44, 87, 20, 84]

In [ ]:
nums.sort(reverse=True)

In [ ]:
print(nums)

[89, 87, 84, 44, 30, 20, 12, 12, 2, 1]

In [ ]:
a = [6, 2, 3, 10, 82, 131]
a.sort()
print(a)

[2, 3, 6, 10, 82, 131]

sort nums (descending):  [80, 77, 58, 48, 48, 41, 39, 30, 19, 16]

### 문제 4

다음과 같은 데이터프레임을 만들어주세요

In [ ]:
import pandas as pd
study_name = ['정연','예인','가연','지원','주리','서연','주연']
study_age = [24, 26, 24, 23, 23, 23, 22]
study = {'name':study_name, 'age':study_age}
df = pd.DataFrame(study)

df

  name  age
0   정연   24
1   예인   26
2   가연   24
3   지원   23
4   주리   23
5   서연   23
6   주연   22

In [ ]:
df

  name age
0   정연  24
1   예인  26
2   가연  24
3   지원  23
4   주리  23
5   서연  23
6   주연  22

####문제4-1
위 df에 포인트를 나타내는 point 열을 추가하세요

In [ ]:
study_point = [97, 98, 83, 86, 88, 89, 90]
df['point'] = study_point

df

  name  age  point
0   정연   24     97
1   예인   26     98
2   가연   24     83
3   지원   23     86
4   주리   23     88
5   서연   23     89
6   주연   22     90

In [ ]:
df

  name age  point
0   정연  24     97
1   예인  26     98
2   가연  24     83
3   지원  23     86
4   주리  23     88
5   서연  23     89
6   주연  22     90

#### 문제 4-2

point가 90점 이상인 데이터프레임만 출력합니다

In [ ]:
dfp = df[df['point'] >= 90]

dfp

  name  age  point
0   정연   24     97
1   예인   26     98
6   주연   22     90

  name age  point
0   정연  24     97
1   예인  26     98
6   주연  22     90

#### 문제 4-3

나이에 따라 오름차순으로 정렬합니다

In [ ]:
dfa = df.sort_values(by='age', ascending=True)

dfa

  name  age  point
6   주연   22     90
3   지원   23     86
4   주리   23     88
5   서연   23     89
0   정연   24     97
2   가연   24     83
1   예인   26     98

  name age  point
6   주연  22     90
3   지원  23     86
4   주리  23     88
5   서연  23     89
0   정연  24     97
2   가연  24     83
1   예인  26     98

## 문제5

아래 주어진 titanic 데이터셋을 활용하여 문제를 풀어주세요

In [ ]:
import seaborn as sns
titanic=sns.load_dataset('titanic')

In [ ]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

#### 문제 5-1

index가 3인 행의 fare 값을 출력하세요

*hint : data.loc[행 index, row index]*

In [ ]:
titanic.loc[3,'fare']

53.1

53.1

#### 문제 5-2

index가 2인 행의 fare부터 adult_male까지의 정보를 출력하세요

In [ ]:
titanic.loc[2,'fare':'adult_male']

fare          7.925
embarked          S
class         Third
who           woman
adult_male    False
Name: 2, dtype: object

fare          7.925
embarked          S
class         Third
who           woman
adult_male    False
Name: 2, dtype: object

#### 문제 5-3
index가 2부터 4인 행의 fare부터 adult_male까지의 정보를 출력하세요

In [ ]:
titanic.loc[2:4, 'fare':'adult_male']

     fare embarked  class    who  adult_male
2   7.925        S  Third  woman       False
3  53.100        S  First  woman       False
4   8.050        S  Third    man        True

     fare embarked  class    who  adult_male
2   7.925        S  Third  woman       False
3  53.100        S  First  woman       False
4   8.050        S  Third    man        True